src/mp_toir/Documents/РегистрацияДефекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияДефекта</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписаниеДефекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мечел_КритичностьДефекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаУстранение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мечел_ДефектыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУстранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Мечел_СпособыУстраненияДефектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДефектУстранен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияДефекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиФиксацииДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефекта</Name>
							<Comment>Для выгрузки в ЕРП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоДефектаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксацияУстранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиУстраненияДефекта</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстранения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоУстраненияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_СтатусыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_СтатусыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженИзКИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыгрузкеВМП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/СтатусыДефектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДефектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Comment>Внесена запись о дефекте. Черновик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноУстранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Устранен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Enums/мп_ИсточникиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_ИсточникиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МечелТОиР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/РегистрацияДефекта/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	НадоОтветДляЕРП = ДополнительныеСвойства.Свойство("ЗагруженИзКИС", Истина);
	Если ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.КВыгрузкевКИС Тогда
		УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);
	ИначеЕсли ЭтотОбъект.СтатусОбмена = Перечисления.мп_СтатусыОбмена.ЗагруженИзКИС И НадоОтветДляЕРП Тогда
		УзелЦентральнойБазы = ОбщегоНазначенияПовтИсп.ПолучитьУзелЦентральнойБазы();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦентральнойБазы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Ошибки = Неопределено;
	АдминТОиР = РольДоступна("мп_АдминистрированиеТОиР");
	Если АдминТОиР Тогда
		Возврат;
	КонецЕсли;
	Если Дефекты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Нельзя провести без дефектов");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Укажите подразделение");
	КонецЕсли;
	ОшибкиДокумента = ЗапретПроведения();

	Если Не ПустаяСтрока(ОшибкиДокумента.СтатусПриПроведении) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			Ошибки, , ОшибкиДокумента.СтатусПриПроведении);
		КонецЕсли;

	Если Не ПустаяСтрока(ОшибкиДокумента.ОтветственныйЗаУстранение) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			Ошибки, , ОшибкиДокумента.ОтветственныйЗаУстранение);
	КонецЕсли;
	
	Если ОшибкиДокумента.ДублиВСтроках Тогда
		Для Каждого ТекСтрока Из ОшибкиДокумента.СписокДублейВСтроках Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если ОшибкиДокумента.СпособУстраненения Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Статус: Отклонен, но дефекты отмечены как устранённые:");
		Для Каждого ТекСтрока Из ОшибкиДокумента.УстранениеДефектов Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если ОшибкиДокумента.ДефектНеПринят Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Есть не устраненные дефекты");
	КонецЕсли;
	
	Если ОшибкиДокумента.НетФото Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , "Нет фото");
		Для Каждого ТекСтрока Из ОшибкиДокумента.СписокФотоПотерь Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, , ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.СтатусыДефектов.Зарегистрирован;
	СтатусОбмена = Перечисления.мп_СтатусыОбмена.Создан;
	КраткоеОписаниеДефекта = "";
	ВерсияДанныхЕРП = "";
	Комментарий = "";
	НомерКИС = "";
	ОтветственныйЗаУстранение = Справочники.Пользователи.ПустаяСсылка();
	
	ФиксацияДефекта.Очистить();
	ФиксацияУстранения.Очистить();
	Для Каждого ТекСтрока Из Дефекты Цикл
		ТекСтрока.ДефектУстранен = 0;
		ТекСтрока.ДатаУстранения = Дата(1, 1, 1);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НарядНаРемонтВызовСервераЛокализация.ПроверкаСтатусаНарядаНаРемонт(Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапретПроведения()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗДефекты.Дефект КАК Дефект,
	|	ТЗДефекты.ДефектУстранен КАК ДефектУстранен,
	|	ТЗДефекты.Узел КАК Узел,
	|	1 КАК СчетчикСтроки,
	|	ТЗДефекты.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ вт_Дефекты
	|ИЗ
	|	&ТЗДефекты КАК ТЗДефекты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Дефекты.Узел КАК Узел,
	|	вт_Дефекты.Дефект КАК Дефект,
	|	вт_Дефекты.СчетчикСтроки КАК СчетчикСтроки,
	|	вт_Дефекты.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ вт_ДублиДефектов
	|ИЗ
	|	вт_Дефекты КАК вт_Дефекты
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Дефекты.Узел,
	|	вт_Дефекты.Дефект,
	|	вт_Дефекты.ИдентификаторСтроки,
	|	вт_Дефекты.СчетчикСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗФиксацияДефекта.ИдентификаторСтрокиДефекта КАК ИдентификаторСтрокиДефекта
	|ПОМЕСТИТЬ вт_ФиксацияДефекта
	|ИЗ
	|	&ТЗФиксацияДефекта КАК ТЗФиксацияДефекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗУстранениеДефекта.ИдентификаторСтрокиДефекта КАК ИдентификаторСтрокиДефекта
	|ПОМЕСТИТЬ вт_УстранениеДефекта
	|ИЗ
	|	&ТЗУстранениеДефекта КАК ТЗУстранениеДефекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Зарегистрирован)
	|			ТОГДА ""Нельзя выгружать со статусом: Зарегистрирован""
	|		КОГДА &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Признан)
	|			ТОГДА ""Нельзя выгружать со статусом: Признан""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Ошибка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ &ЭтоБригадир
	|					И &Источник = ЗНАЧЕНИЕ(Перечисление.мп_ИсточникиДокументов.МечелТОиР)
	|					И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Зарегистрирован), ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Признан))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И &СтатусОбмена = ЗНАЧЕНИЕ(Перечисление.мп_СтатусыОбмена.КВыгрузкеВКИС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Укажите ответственного за устранение"" КАК Ошибка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЭтоБригадир
	|					И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Зарегистрирован), ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Признан))
	|					И ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) = &ОтветственныйЗаУстранение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_Дефекты.Дефект) КАК Дефект,
	|	""Укажите фото дефекта"" КАК Описание
	|ИЗ
	|	вт_Дефекты КАК вт_Дефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ФиксацияДефекта КАК вт_ФиксацияДефекта
	|		ПО вт_Дефекты.ИдентификаторСтроки = вт_ФиксацияДефекта.ИдентификаторСтрокиДефекта
	|ГДЕ
	|	ВЫРАЗИТЬ(вт_Дефекты.Дефект КАК Справочник.Мечел_ДефектыОборудования).мп_ФотоОбязательно
	|	И вт_ФиксацияДефекта.ИдентификаторСтрокиДефекта ЕСТЬ NULL
	|	И ЗНАЧЕНИЕ(Перечисление.мп_ИсточникиДокументов.МечелТОиР) = &Источник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_Дефекты.Дефект),
	|	""Укажите фото устранения дефекта""
	|ИЗ
	|	вт_Дефекты КАК вт_Дефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_УстранениеДефекта КАК вт_УстранениеДефекта
	|		ПО вт_Дефекты.ИдентификаторСтроки = вт_УстранениеДефекта.ИдентификаторСтрокиДефекта
	|ГДЕ
	|	ВЫРАЗИТЬ(вт_Дефекты.Дефект КАК Справочник.Мечел_ДефектыОборудования).мп_ФотоОбязательно
	|	И вт_УстранениеДефекта.ИдентификаторСтрокиДефекта ЕСТЬ NULL
	|	И вт_Дефекты.ДефектУстранен = 1
	|	И ЗНАЧЕНИЕ(Перечисление.мп_ИсточникиДокументов.МечелТОиР) = &Источник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_ДублиДефектов.Узел) КАК Узел,
	|	ПРЕДСТАВЛЕНИЕ(вт_ДублиДефектов.Дефект) КАК Дефект
	|ИЗ
	|	вт_ДублиДефектов КАК вт_ДублиДефектов
	|
	|СГРУППИРОВАТЬ ПО
	|	ПРЕДСТАВЛЕНИЕ(вт_ДублиДефектов.Узел),
	|	ПРЕДСТАВЛЕНИЕ(вт_ДублиДефектов.Дефект)
	|
	|ИМЕЮЩИЕ
	|	СУММА(вт_ДублиДефектов.СчетчикСтроки) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(вт_Дефекты.Дефект) КАК Дефект,
	|	ВЫБОР
	|		КОГДА вт_Дефекты.ДефектУстранен = 1
	|			ТОГДА ""Устранен""
	|		КОГДА вт_Дефекты.ДефектУстранен = 2
	|			ТОГДА ""Устранение отложено""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДефектУстранен
	|ИЗ
	|	вт_Дефекты КАК вт_Дефекты
	|ГДЕ
	|	вт_Дефекты.ДефектУстранен В (1)
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Отклонен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Ошибка
	|ИЗ
	|	вт_Дефекты КАК вт_Дефекты
	|ГДЕ
	|	вт_Дефекты.ДефектУстранен <> 1
	|	И &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДефектов.Устранен)";
	
	Запрос.УстановитьПараметр("ТЗДефекты", ЭтотОбъект.Дефекты.Выгрузить());
	Запрос.УстановитьПараметр("ТЗФиксацияДефекта", ЭтотОбъект.ФиксацияДефекта.Выгрузить( , "ИдентификаторСтрокиДефекта"));
	Запрос.УстановитьПараметр("ТЗУстранениеДефекта", ЭтотОбъект.ФиксацияУстранения.Выгрузить( , "ИдентификаторСтрокиДефекта"));
	Запрос.УстановитьПараметр("Статус", ЭтотОбъект.Статус);
	Запрос.УстановитьПараметр("СтатусОбмена", ЭтотОбъект.СтатусОбмена);
	Запрос.УстановитьПараметр("ОтветственныйЗаУстранение", ЭтотОбъект.ОтветственныйЗаУстранение);
	ЭтоБригадир = (РольДоступна("мп_АдминистрированиеТОиР") Или РольДоступна("мп_БригадирТОиР"));
	Запрос.УстановитьПараметр("ЭтоБригадир", ЭтоБригадир);
	Запрос.УстановитьПараметр("Источник", ЭтотОбъект.Источник);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ИндексПоследнегоПакета = ПакетРезультатов.ВГраница();
	
	ОшибкиДокумента = Новый Структура;
	ПС = Символы.ПС;
	Таб = " ~";
	
	ЗапросСтатусПроведения = ПакетРезультатов[ИндексПоследнегоПакета - 5];
	
	СтатусПриПроведении = "";
	Если Не ЗапросСтатусПроведения.Пустой() Тогда
		Выборка = ЗапросСтатусПроведения.Выбрать();
		Выборка.Следующий();
		СтатусПриПроведении = Выборка.Ошибка;
	КонецЕсли;
	ОшибкиДокумента.Вставить("СтатусПриПроведении", СтатусПриПроведении);
	
	ЗапросБригадир = ПакетРезультатов[ИндексПоследнегоПакета - 4];
	
	ОшибкаОтветственныйЗаУстранение = "";
	Если Не ЗапросБригадир.Пустой() Тогда
		Выборка = ЗапросБригадир.Выбрать();
		Выборка.Следующий();
		ОшибкаОтветственныйЗаУстранение = Выборка.Ошибка;
	КонецЕсли;
	ОшибкиДокумента.Вставить("ОтветственныйЗаУстранение", ОшибкаОтветственныйЗаУстранение);
	
	ЗапросФотоДефекта = ПакетРезультатов[ИндексПоследнегоПакета - 3];
	ОшибкиДокумента.Вставить("НетФото", Не ЗапросФотоДефекта.Пустой());
	СписокФотоПотерь = Новый Массив;
	Выборка = ЗапросФотоДефекта.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокФотоПотерь.Добавить(Выборка.Описание + ПС + Таб + "дефект: " + Выборка.Дефект);
	КонецЦикла;
	ОшибкиДокумента.Вставить("СписокФотоПотерь", СписокФотоПотерь);

	ЗапросДублиВСтроках = ПакетРезультатов[ИндексПоследнегоПакета - 2];

	ОшибкиДокумента.Вставить("ДублиВСтроках", Не ЗапросДублиВСтроках.Пустой());

	СписокДублейВСтроках = Новый Массив;

	Выборка = ЗапросДублиВСтроках.Выбрать();

	Пока Выборка.Следующий() Цикл
		СписокДублейВСтроках.Добавить("Указан более чем в одной строке:" + ПС+ Таб + "Дефект: " + Выборка.Дефект + ПС + Таб + "Узел: " + Выборка.Узел);
	КонецЦикла;
	
	ОшибкиДокумента.Вставить("СписокДублейВСтроках", СписокДублейВСтроках);

	ЗапросДефектыУстранены = ПакетРезультатов[ИндексПоследнегоПакета - 1];
	
	ОшибкиДокумента.Вставить("СпособУстраненения", Не ЗапросДефектыУстранены.Пустой());
	
	УстранениеДефектов = Новый Массив;
	Выборка = ЗапросДефектыУстранены.Выбрать();
	Пока Выборка.Следующий() Цикл
		УстранениеДефектов.Добавить(Выборка.Дефект + ПС + Таб + Выборка.ДефектУстранен);
	КонецЦикла;
	
	ОшибкиДокумента.Вставить("УстранениеДефектов", УстранениеДефектов);

	ЗапросДефектНеПринят = ПакетРезультатов[ИндексПоследнегоПакета];
	ОшибкиДокумента.Вставить("ДефектНеПринят", Не ЗапросДефектНеПринят.Пустой());
	
	Возврат ОшибкиДокумента;

КонецФункции

#КонецОбласти

#Иначе

	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
